---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceWallBadType
source: html/bc3be4e6-e2c9-4f54-38ca-a52033889ddf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.FaceWallBadType Property

Wall type '[Type Name]' is incompatible with picked face. Only basic wall types are accepted.

## Syntax (C#)
```csharp
public static FailureDefinitionId FaceWallBadType { get; }
```